#define DRINK 10
#define FILLER 8
#define DIFFICULT 7

const char* armenian[] =
{
	" Мы можем заработать и накопить много денег, купить, все что душе заблагорассудится. А после этого вдруг безответно влюбившись или заболев мощно, понять, что не в деньгах и вещах счастье. В всякой момент богач быть может вдруг остаться бедняком. Давайте—ка выпьем за ценности, которые действительно вечны и которые стоит накапливать: за любовь, знания и доброту!",
	" Два армянина: — Видел, дэвушка мне улыбнулась? — А, Самвэл, я тоже когда тебя первый раз увидел, чуть со смеху не помер, да! Выпьем за то, чтобы красивые девушки нам не только улыбались, но и разделяли с нами отдых и сразу соглашались провести с нами часок—другой!",
	"Чем старше вино, тем богаче его букет и изысканней вкус. Давайте же выпьем за то, чтобы наш юбиляр, как хорошее вино, становился все ценнее и лучше с годами, накапливая букет прекрасных воспоминаний и живя со вкусом!",
	"Высоко в горах жил орел с орлицей и маленькими орлятами. Однажды, возвращаясь с охоты, решил орел испытать свою орлицу, проверить, насколько она храбра, как защищает гнездо, орлят от чужих. Он надел на себя шкуру тигра и начал медленно подбираться к гнезду. Орлица, увидев крадущегося к гнезду тигра, смело бросилась на него. Вах, как она его клевала, била крыльями, и рвала когтями! И не дав даже опомниться, сбросила на самое дно самого глубокого ущелья. Так выпьем же за храбрых женщин и за то, чтоб в каком бы виде муж ни приходил домой, жена бы его всегда узнавала!",
	"Ароматная женщина — та, которая привносит в жизнь мужчины нежные ароматы любви. За самую лучшую ароматерапию — ароматных женщин!",
	"Было это очень давно, когда горы Армении были еще выше, чем ныне. Стоял обнаженный Ашот у скалы, на его голове была шляпа. К Ашоту подошла первобытная обнаженная женщина. Ашот прикрыл шляпой низ живота. Женщина сначала убрала одну руку Ашота, затем — другую. Шляпа продолжала прикрывать низ живота. Давайте выпьем за силу, которая держала шляпу!",
	"Гоги принимал экзамен в университете. И приходит к нему студент, ставит на стол три бутылки армянского коньяка и просит: \\\\  — Поставьте мне три, профессор!\\\\Гоги приближает к себе две бутылки:\\\\— Пожалуй, двух мне будет достаточно.\\\\ Поднимем же бокалы за нас, честных работников, не забывающих о собственных интересах!",
	"Армянская народная мудрость гласит, что если вы ищете идеальных друзей, то вы их никогда не найдете. Поэтому я хочу поднять свой бокал за вас — моих друзей, и пожелать, чтобы мы принимали друг друга такими, какие мы есть на самом деле!",
	"Есть такая армянская поговорка: «Как работать — руки дрожат, а на отдыхе рюмочку держат». Отдыхать — не работать. Выпьем вина!",
	"На склоне седого кавказа, Среди снежных могучих вершин, Кто-то золотом выбил на камне \"Гордись, что ты Армянин.\"",
};

const char* difficult[] =
{
	"Не, друг, такое у нас в Армении не принято...",
	"Я свой вены хавал...",
	"Боже мой...",
	"Гость джан, эти недапанимания надо исправлять", 
	"Дай бог сил упростить это выражение",
	"Не переживай, сейчас армяне украсят этот ужас",
	"Может партию? Пока оно упрощается...",
	"А где-то горы-горы, а за ними-ними..."
};

const char* filler[] = 
{
	" Как говорил мой дед",
	" У нас в Армении принято считать, что",
	" Брат, сам в шоке, но отвечаю, что",
	" Девушка, ваши глаза настолько красивые, что по ним видно, что",
	" Ты пока мясо кушай, а мы с Вазгенчиком посчитаем, что",
	" Это я тебе как армянин говорю:",
	" Однажды один мудрец произнес:",
	" Пока играли, выражение пришло к виду:",
};
